/*
* - Conspect Module - 2_4

! ========================================
 */

// // 1. Объявление глобальной переменной result
// let result;
// // 2. Объявление функции multiply
// function multiply(x) {
//     // let result;
//     result = x * 2;

//     // console.log("Это лог при вызове функции multiply: " + result);
//     // let resultOut;
//     // resultOut = `Это лог при вызове функции multiply: ${result} this is output "resultOut"`
//     // console.log(resultOut);
//     // console.log("======================================================================");
//     return result;
//     // console.log(resultOut);
// }

// // 3. Вызовы функции multiply
// // multiply(1); // 
// // multiply(2); // 
// // console.log(result);
// // multiply(3); // 
// // console.log(result);


// // 3-1. Вызовы функции multiply
// console.log(multiply(1));
// console.log(`This is output "result": ${result}`);

// console.log(multiply(2));
// console.log(`This is output "result": ${result}`);

// console.log(multiply(3));
// console.log(`This is output "result": ${result}`);

/*
* - 
! ========================================
 */

// // Объявление параметров x, y, z
// function multiply(x, y, z) {
//   console.log(`Результат умножения равен ${x * y * z}`);
// }

// // 2. Передача аргументов
// multiply(1, 2, 3); // 6
// multiply(4, 5, 6); // 120
// multiply(7, 8, 9); // 504

/*
* - 
! ========================================
 */

// function multiply(x, y, z) {
//     console.log("Код до return выполняется как обычно");
//     let result;
//     result = x * y * z;
// //    

//   // Возвращаем результат выражения умножения
//   return result;
    
//   console.log("Этот лог никогда не выполнится, он стоит после return");
// }

// // Результат работы функции можно сохранить в переменную
// let result = multiply(2, 3, 5);
// console.log(result); // 30

// result = multiply(4, 8, 12);
// console.log(result); // 384

// result = multiply(17, 6, 25);
// console.log(result); // 2550

/*
* - 
! ========================================
 */

// function multiply(x, y, z) {
//   console.log("Код до return выполняется как обычно");

//   // Возвращаем результат выражения умножения
//   return x * y * z;

//   console.log("Этот лог никогда не выполнится, он стоит после return");
// }

// // Результат работы функции можно сохранить в переменную 1-вариант
// console.log("Результат работы функции 1-вариант:")
// console.log("***********************************")

// let result = multiply(2, 3, 5);
// console.log(result); // 30

// result = multiply(4, 8, 12);
// console.log(result); // 384

// result = multiply(17, 6, 25);
// console.log(result); // 2550

// console.log("___________________________________")

// // Результат работы функции можно сохранить в переменную 2-вариант
// console.log("Результат работы функции 2-вариант:")
// console.log("***********************************")
// console.log(multiply(2, 3, 5));
// console.log(multiply(4, 8, 12))
// console.log(multiply(17, 6, 25))
// console.log("___________________________________")

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

/*
* - 
! ========================================
 */

