/*
* - Conspect Module - 3_5

! ========================================
 */

//Используя конструкцию if...else,
//напишите код, который будет спрашивать:
//"Какое официальное название JavaScript?"
//Если пользователь вводит "ECMAScript",
//то показать через alert: "Верно!"
//в противном случае отобразить:"Не знаете? ECMAScript!"

// const qestion = prompt("Какое официальное название JavaScript?");
// console.log(qestion);
//     if (qestion === "ECMAScript") {
//         alert("Верно!");
//     } else { alert("Не знаете? ECMAScript!"); };

/*
* - 
! ========================================
 */

// Напишите программу, которая получит от пользователя:
//число (количество минут) и выведет в консоль
//строку в формате часов и минут


// const ansver = prompt("Введите число");
// console.log(ansver);

// // const ansverNum = Number(ansver);
// // console.log(ansverNum);

// let hours = 0;
// let minutes = 0;

// if (ansver) {
//     console.log(typeof ansver);
    
//     hours = String(Number.parseInt(ansver / 60)).padStart(2, 0); //! String.prototype.padStart(targetLength, [padString]) -
//* - заполняет текущую строку(в начале(слева) текущей строки) другой строкой(несколько раз, если нужно) так, 
//* что итоговая строка достигает заданной длины.
//* https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart
//     console.log(hours);

//     minutes = String(ansver % 60).padStart(2, 0);
//     console.log(minutes);

//     console.log("Time", hours, ":", minutes);

// } else {
//     alert("Введите число")
// }

/*
* - 
! ========================================
 */

// Напишите цикл, который выводит в консоль
//числа от max до min по убыванию
// Додайте все четные числа от min до max
// const max = 50;
// const min = 23;

// const max = 60;
// const min = 10;
// let result = 0;

// for (let i = max; i >= min; i -= 1) {
//     // console.log(i);
//     if (i % 2 === 0) {
//         result += i;
//     }
// }
// console.log(result);

/*
* - 
! ========================================
 */

// const showThis = () => {
//     console.log("This in showThis: ", this);
// }

// showThis();

// const user = { name: "Mango" };
// user.showContext = showThis;

// console.log(user);

// user.showContext();


/*
* - 
! ========================================
 */

// //? =======================================
// // new Date()
// console.log("new Date():", new Date()); //!
// //? =======================================
// // Date.now () 
// console.log("Date.now:", Date.now ()); //!
// //? =======================================

/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */


/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */

