/*
* - Conspect Module - 8_15
TODO
! ========================================
 */
// TODO

/*  
!    Первый способ - это использовать 
!    ключевое слово export перед всеми сущностями, 
!    которые необходимо экспортировать. 
*/
// const sqrt = Math.sqrt;
// export const square = x => x * x;
// export const diag = (x, y) => sqrt(square(x) + square(y));

/*
* - 
! ========================================
 */

/*  
!   Второй способ - 
!    это явно указать объект 
!    со свойствами для экспорта.
*/

const sqrt = Math.sqrt;
const square = x => x * x;
const diag = (x, y) => sqrt(square(x) + square(y));

export { square, diag };

/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */



/*
* - 
! ========================================
 */